In [ ]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd
s = [4,8,15,16,23,42]
df = pd.Series(s)

In [3]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
# variable print it.

In [4]:
l = [1,2,3,4,6,4,6,7,8,4,8]
df = pd.Series(l)

In [5]:
df

0     1
1     2
2     3
3     4
4     6
5     4
6     6
7     7
8     8
9     4
10    8
dtype: int64

In [7]:
import pandas as pd
data = {'Name': ['Alice','Bob', 'Claire'],
        'Age' : [25,30,70],
        'Gender' : ['Female','Male','Female']
       }
df = pd.DataFrame(data)

In [8]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   70  Female

In [ ]:
# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
Ans:- DataFrame is a similar to a spreadsheet or SQL table, but with additional features such as multi-
    level indexing, powerful grouping and aggregation capabilities and support for missing data.
    similarly, Series is a one dimensional label array capable of holding data of any type.

In [9]:
import pandas as pd
s = pd.Series([2,3,5,6,4])
data = {'Name' : ['Alice', 'Nawaj','Brokly'],
        'Age' : [23,54,23]
       }
df = pd.DataFrame(data)
df1 = pd.Series(s)

In [10]:
df

     Name  Age
0   Alice   23
1   Nawaj   54
2  Brokly   23

In [11]:
df1

0    2
1    3
2    5
3    6
4    4
dtype: int64

In [29]:
# Q5. Create a DataFrame using multiple Series. Explain with an example.

import pandas as pd
names = pd.Series(['Brokly', 'Mohan','Arjun'])
grades = pd.Series([34,65,34])
age = pd.Series([23,32,23])
df = pd.DataFrame({'Name': names, 'Grade': grades, 'Age': age})

In [30]:
df

     Name  Grade  Age
0  Brokly     34   23
1   Mohan     65   32
2   Arjun     34   23

In [32]:
df.set_index("Name")

        Grade  Age
Name
Brokly     34   23
Mohan      65   32
Arjun      34   23